anhtu91/MSP432_TM4C1294/MSP432_cs_reference_oscillator_MSP_EXP432P401R_nortos_ccs/cs_reference_oscillator.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
/*******************************************************************************
 * MSP432 Clock System - Reference Oscillator
 *
 * Description: This is a simple code example that sources MCLK from the
 * internal reference oscillator and blinks an LED using the SysTick
 * module. An interrupt occurs on P1.1 (the switch) which will change the
 * frequency of the reference oscillator between the two modes (32khz and
 * 128 khz).
 *
 *              MSP432P401
 *             ------------------
 *         /|\|                  |
 *          | |                  |
 *          --|RST         P1.0  |---> P1.0 LED
 *            |                  |
 *            |            P1.1  |<--Toggle Switch
 *            |                  |
 *            |                  |
 *
 ******************************************************************************/
/* DriverLib Includes */
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>

/* Standard Includes */
#include <stdint.h>
#include <stdbool.h>

/* Statics */
static volatile bool is32khz;
static volatile uint32_t clock_MCLK, clock_ACLK, clock_DCO;

int main(void)
{
    /* Halting the Watchdog */
    MAP_WDT_A_holdTimer();
    is32khz = true;

    /* Configuring P1.1 as input for switch and P1.0 as LED */
    //GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0);
    GPIO_setAsOutputPin(GPIO_PORT_P3, GPIO_PIN6 | GPIO_PIN7);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN1);

    /* Initializing MCLK to REFO */
    CS_initClockSignal(CS_MCLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_ACLK, CS_LFXTCLK_SELECT, CS_CLOCK_DIVIDER_2);

    clock_MCLK = CS_getMCLK(); // get clock mclk
    clock_ACLK = CS_getACLK(); // get clock aclk
    clock_DCO = CS_getDCOFrequency(); // get clock DCO

    /* Since we are operating at 32khz, we can operating in LF mode */
    PCM_setPowerMode(PCM_LF_MODE);

    /* Configuring SysTick to trigger at 16000. At 32khz, this will make
     * the LED toggle every 0.5s and at 128khz this will make it toggle
     * 4x as fast.
     */
    SysTick_enableModule();
    SysTick_setPeriod(16000);
    SysTick_enableInterrupt();
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN1);
    Interrupt_enableInterrupt(INT_PORT1);

    /* Enabling MASTER interrupts */
    Interrupt_enableMaster();

    while (1)
    {
        PCM_gotoLPM0();
    }
}

/* SysTick ISR */
void SysTick_Handler(void)
{
    //GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
    GPIO_toggleOutputOnPin(GPIO_PORT_P3, GPIO_PIN6 | GPIO_PIN7);
}

/* Port 1 ISR */
void PORT1_IRQHandler(void)
{
    uint32_t status;

    status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P1);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, status);

    if(status & GPIO_PIN1)
    {

        if(is32khz)
            CS_setReferenceOscillatorFrequency(CS_REFO_128KHZ);
        else
            CS_setReferenceOscillatorFrequency(CS_REFO_32KHZ);

        is32khz = !is32khz;

    }

}

